//Copyright (C)2014-2023 GOWIN Semiconductor Corporation.
//All rights reserved.
//File Title: Timing Constraints file
//GOWIN Version: 1.9.9 Beta-3
//Created Time: 2023-11-14 14:51:36
create_clock -name clock_25MHz -period 40 -waveform {0 20} [get_ports {CLK25M}]
create_clock -name clock_eth0rx_ext -period 8 -waveform {0 4} [get_ports {ETH0_RXCLK}]
create_generated_clock -name clock_common -source [get_ports {CLK25M}] -master_clock clock_25MHz -divide_by 2 -multiply_by 1 -duty_cycle 50 [get_pins {common_rpll1/rpll_inst/CLKOUT}]
create_generated_clock -name clock_sdram -source [get_ports {CLK25M}] -master_clock clock_25MHz -divide_by 1 -multiply_by 5 -duty_cycle 50 [get_pins {sdram_rpll1/rpll_inst/CLKOUT}]
create_generated_clock -name clock_gpu -source [get_ports {CLK25M}] -master_clock clock_25MHz -divide_by 1 -multiply_by 5 -duty_cycle 50 -phase 45 [get_pins {sdram_rpll1/rpll_inst/CLKOUTP}]
create_generated_clock -name clock_250MHz -source [get_ports {CLK25M}] -master_clock clock_25MHz -multiply_by 9 -duty_cycle 50 [get_pins {lcd_sclk_pll/rpll_inst/CLKOUT}]
create_generated_clock -name clock_sclk -source [get_ports {CLK25M}] -master_clock clock_25MHz -multiply_by 9 -duty_cycle 50 -phase 45 [get_pins {lcd_sclk_pll/rpll_inst/CLKOUTP}]
create_generated_clock -name clock_pclk -source [get_ports {CLK25M}] -master_clock clock_25MHz -divide_by 7 -multiply_by 20 -duty_cycle 50 [get_pins {lcd_pclk_pll/clkdiv_inst/CLKOUT}]
set_false_path -from [get_clocks {clock_pclk}] -to [get_clocks {clock_sclk}] 
set_false_path -to [get_regs {grafics_ctr1/lcd_err_ind1/c.d[0].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[0].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[0].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[0].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[1].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[1].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[1].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[1].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[2].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[2].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[2].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[2].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[3].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[3].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[3].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[3].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[4].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[4].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[4].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[4].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[5].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[5].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[5].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[5].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[6].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[6].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[6].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[6].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[7].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[7].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[7].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[7].err_x/sync_pulse_data_b_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[8].err_x/spulse_sync.dff_in.int_false_path_sync_0_s0 grafics_ctr1/lcd_err_ind1/c.d[8].err_x/spulse_sync.dff_in.int_false_path_sync_1_s0 grafics_ctr1/lcd_err_ind1/c.d[8].err_x/sync_pulse_data_a_false_path_sync_s0 grafics_ctr1/lcd_err_ind1/c.d[8].err_x/sync_pulse_data_b_false_path_sync_s0 sync_all/eth_sync/input_delay_false_path_sync_1_s0 sync_all/eth_sync/sync_pulse_data_a_false_path_sync_s0 sync_all/eth_sync/sync_pulse_data_b_false_path_sync_s0 sync_all/gpu_sync/input_delay_false_path_sync_1_s0 sync_all/gpu_sync/sync_pulse_data_a_false_path_sync_s0 sync_all/gpu_sync/sync_pulse_data_b_false_path_sync_s0 sync_all/lcd_sync/input_delay_false_path_sync_1_s0 sync_all/lcd_sync/sync_pulse_data_a_false_path_sync_s0 sync_all/lcd_sync/sync_pulse_data_b_false_path_sync_s0 sync_all/reset_sync/input_delay_false_path_sync_1_s0 sync_all/reset_sync/sync_pulse_data_a_false_path_sync_s0 sync_all/reset_sync/sync_pulse_data_b_false_path_sync_s0}] 
report_high_fanout_nets -max_nets 100
set_operating_conditions -grade c -model slow -speed 8 -setup -hold -max -min -max_min
